{
  "articles": [
    {
      "id": "1",
      "title": "Регистрация",
      "description": "Регистрация\nДля начала обучения на сайте вам необходимо пройти регистрацию.\n\nНужно указать настоящие имя и фамилию, а также действующий e-mail — для подтверждения регистрации и получения различной информации по курсам. После подтверждения e-mail вы сможете выбирать интересующие вас курсы и записываться на них.\n\nДля входа на платформу можно также использовать ряд аккаунтов сторонних сайтов. Кроме аккаунтов социальных сетей (Facebook, VK, Twitter), Вы можете также воспользоваться аккаунтом GitHub. Подключить любой из этих аккаунтов можно в разделе Профиль --> Настройки --> Вход через социальные сети. Там же любой из этих аккаунтов можно отключить.\n\nОбратите внимание, если Вы хотите отключить аккаунт, который Вы использовали при первом логине на Stepik через социальные сети, сначала необходимо установить пароль (Профиль --> Настройки --> Установить пароль) и затем отключать вход через соцсеть.\n\nПосле регистрации при заходе на Stepik Вы будете сразу попадать на свою страницу."
    },
    {
      "id": "2",
      "title": "Профиль пользователя",
      "description": "На странице пользователя собрана вся полезная и важная информация: «Мои курсы», «Преподавание» (если вы создавали какие-то уроки или курсы), «Профиль» (где отражена ваша активность и краткая биография), «Сертификаты» (можно в одном месте просмотреть все полученные сертификаты).\n\nНа своей странице можно – создать урок или курс, отредактировать данные в профиле, просмотреть календарь активностей, узнать свои знания и репутацию. \n\nПри редактировании профиля можно:\n\nизменить личные данные (обратите внимание на ограничение по символам в этих полях),\nустановить или изменить пароль,\nизменить e-mail адрес и настроить вход через социальные аккаунты,\nнастроить уведомления,\nуказать город проживания,\nуказать аккаунты в соцсетях, которые будут отображаться на странице профиля.\nскрыть сертификаты, если вы не хотите, чтобы их видели другие пользователи. \nКаждый пользователь на сайте имеет свой уникальный ID, который отображается в адресной строке при просмотре профиля, а также в самом профиле рядом с датой регистрации на сайте.\n\nПрофиль пользователя, по умолчанию создаётся всем пользователям и одинаков и для учащихся, и для преподавателей. \nПрофиль организации, уже после создания обычный профиль может быть переведен в такой статус. Пример: https://stepik.org/org/yandex_academy. Если вы хотите получить такой профиль, нужно придумать короткое название для адреса, например, yandex_academy, и написать нам его и ссылку на сам профиль на support@stepik.org."
    },
    {
      "id": "3",
      "title": "Как восстановить пароль?",
      "description": "Если вы забыли пароль, то вы можете воспользоваться формой для сброса пароля по ссылке: https://stepik.org/accounts/password/reset/\n\nУкажите в этой форме ту почту, которую вы ввели при регистрации. На нее придет письмо со ссылкой для сброса пароля.\nСкопируйте ее и вставьте в браузер.\nВведите новый пароль и еще раз авторизуйтесь – со старой почтой и новым паролем.\nОбратите внимание:\nписьмо может немного задержаться;\nесли письмо не пришло, проверьте папку «Спам»;\nесли письма там нет попробуйте добавить наш адрес noreply@stepik.org в число контактов в вашем почтовом клиенте, так мы исключим вероятность того, что наши автоматические письма будут удаляться спам-фильтрами. После этого запросите форму для восстановления пароля еще раз;\nтехподдержка Stepik не может помочь вам со сменой пароля, сбросить пароль может только сам пользователь."
    },
    {
      "id": "4",
      "title": "Как получить сертификат по курсу?",
      "description": "Во многих (но не во всех) курсах на Stepik выдаются сертификаты. Если сертификат выдаётся, то информация об этом указана на главной странице курса (в разделе \"Сертификат\"), там же вы можете узнать, сколько для получения сертификата необходимо баллов.\n\nЕсть два способа выдачи сертификатов\n1. Если в курсе есть дедлайны (сроки сдачи заданий, после мягкого дедлайна будет начислено меньше баллов (количество устанавливается преподавателем), после жёсткого дедлайна баллы не начисляются), то сертификат выдаётся всем учащимся одновременно после того, как прошел последний дедлайн.\n\n2. Если в курсе дедлайнов нет, то сертификаты выдаются в течение суток, как только вы набрали нужно число баллов, а затем обновляются пока вы решаете новые задачи."
    },
    {
      "id": "5",
      "title": "Как поступить и как покинуть курс",
      "description": "Поступить на курс\nЗаписаться на курс можно по кнопке \"Поступить на курс\" на промостранице курса.Все курсы, на которые вы записались, будут перечислены в вашем профиле, в категории \"Мои курсы\".\n\nПокинуть курс\nЧтобы покинуть курс, нужно нажать на кнопку \"Покинуть\" рядом с выбранным курсом. Обратите внимание, что, когда вы покидаете курс, ваш прогресс по курсу сохраняется, и он не сбросится, если вы поступите на курс заново. Однако, покинув курс, вы перстанете получать все новости курса.\n\nИзбранное и архив\nЛюбые курсы на Stepik вы можете сделать избранными, и они будут показываться в специальном пункте вашего профиля\nЛюбой курс вы можете переместить в архив. Вы остаетесь записанными на курс, но кур не будет отображаться в разделе \"Мои курсы\".\n\nВ архив курсы также попадают автоматически, если:\n\nВы набрали 100% прогресса (прогресс считается по шагам, а не баллам);\nКурс стал полностью закрытым по датам.\nЛюбой курс можно вручную вернуть из \"Архива\" в \"Мои курсы\".\n\nОбратите внимание: если вы покинете курс, добавленный в \"Архив\" или \"Избранное\", курс исчезнет из этих разделов. \n\n"
    },
    {
      "id": "6",
      "title": "Знания и репутация",
      "description": "При прохождении уроков на Stepik пользователи получают баллы знаний и репутации. Суммарное количество знаний и репутации отображается в профиле пользователя. На Stepik можно посмотреть 20 лучших учащихся по знаниям и 20 лучших учащихся по репутации.\n\nЗнания\nЗнания вы получаете за успешное решение задач в уроках. Знания даются только в уроках, которые пройдены более, чем 100 другими пользователями.\n\nЗа каждую задачу можно получить 1 балл знаний. \n\nРепутация\nРепутацию можно получать, когда другие пользователи решают ваши уроки или положительно оценивают ваши комментарии. Учитываются только шаги с более чем 100 решениями."
    }
  ]
}